# Задача 3_1
print("Добро пожалуйста в нашу клинику")
petType = input("К какому виду относится ваш питомец? :")
name =  input("Введите имя питомца :")
petAge = input("Введите возраст :")
print(f"Это {petType} по кличке \"{name}\". Возраст: {petAge} года.")